Revit 2026 API

# FilteredWorksetCollectorFirstWorksetId Method

---

Returns the id of the first workset to pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetId FirstWorksetId()
```
```vb
Public Function FirstWorksetId As WorksetId
```
```cpp
public:
WorksetId^ FirstWorksetId()
```
```fsharp
member FirstWorksetId : unit -> WorksetId
```

#### Return Value

WorksetId The first workset id.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter. |

This will reset the collector to the beginning and find the first workset that passes the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace